<a href="https://colab.research.google.com/github/srujan2309/Python-for-DS/blob/main/Pandas_Introduction_mine.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (1.1.5)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas) (2018.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.7/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [ ]:
import pandas as pd

In [ ]:
#Import Python Libraries
import numpy as np
import pandas as pd
import matplotlib as mpl
import seaborn as sns

In [ ]:
df = pd.read_csv("/content/sample_data/Salaries.csv",index_col=0)

In [ ]:
df.head()

       rank discipline  yrs.since.phd  yrs.service   sex  salary
1      Prof          B             19           18  Male  139750
2      Prof          B             20           16  Male  173200
3  AsstProf          B              4            3  Male   79750
4      Prof          B             45           39  Male  115000
5      Prof          B             40           41  Male  141500

In [ ]:
df.columns

Index(['rank', 'discipline', 'yrs.since.phd', 'yrs.service', 'sex', 'salary'], dtype='object')

In [ ]:
df.dtypes

rank             object
discipline       object
yrs.since.phd     int64
yrs.service       int64
sex              object
salary            int64
dtype: object

In [ ]:
df.axes

[Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
             ...
             388, 389, 390, 391, 392, 393, 394, 395, 396, 397],
            dtype='int64', length=397),
 Index(['rank', 'discipline', 'yrs.since.phd', 'yrs.service', 'sex', 'salary'], dtype='object')]

In [ ]:
df.size

2382

In [ ]:
df.shape

(397, 6)

In [ ]:
df.ndim

2

In [ ]:
df.values

array([['Prof', 'B', 19, 18, 'Male', 139750],
       ['Prof', 'B', 20, 16, 'Male', 173200],
       ['AsstProf', 'B', 4, 3, 'Male', 79750],
       ...,
       ['Prof', 'A', 42, 25, 'Male', 101738],
       ['Prof', 'A', 25, 15, 'Male', 95329],
       ['AsstProf', 'A', 8, 4, 'Male', 81035]], dtype=object)

In [ ]:
len(df.columns)

6

In [ ]:
df.columns

Index(['rank', 'discipline', 'yrs.since.phd', 'yrs.service', 'sex', 'salary'], dtype='object')

In [ ]:
df.dtypes

rank             object
discipline       object
yrs.since.phd     int64
yrs.service       int64
sex              object
salary            int64
dtype: object

In [ ]:
len(df)

397

In [ ]:
dir(df)

In [ ]:
df.describe()

In [ ]:
df.describe

In [ ]:
df.mean()

In [ ]:
 a = df.head(50)

In [ ]:
a = df.head(50)

yrs.since.phd        20.92
yrs.service          16.22
salary           112625.64
dtype: float64

In [ ]:
df.std()

yrs.since.phd       12.887003
yrs.service         13.006024
salary           30289.038695
dtype: float64

In [ ]:
df.describe()

       yrs.since.phd  yrs.service         salary
count     397.000000   397.000000     397.000000
mean       22.314861    17.614610  113706.458438
std        12.887003    13.006024   30289.038695
min         1.000000     0.000000   57800.000000
25%        12.000000     7.000000   91000.000000
50%        21.000000    16.000000  107300.000000
75%        32.000000    27.000000  134185.000000
max        56.000000    60.000000  231545.000000

In [ ]:
a

         rank discipline  yrs.since.phd  yrs.service     sex  salary
1        Prof          B             19           18    Male  139750
2        Prof          B             20           16    Male  173200
3    AsstProf          B              4            3    Male   79750
4        Prof          B             45           39    Male  115000
5        Prof          B             40           41    Male  141500
6   AssocProf          B              6            6    Male   97000
7        Prof          B             30           23    Male  175000
8        Prof          B             45           45    Male  147765
9        Prof          B             21           20    Male  119250
10       Prof          B             18           18  Female  129000
11  AssocProf          B             12            8    Male  119800
12   AsstProf          B              7            2    Male   79800
13   AsstProf          B              1            1    Male   77700
14   AsstProf          B              2            0    Male   78000
15       Prof          B             20           18    Male  104800
16       Prof          B             12            3    Male  117150
17       Prof          B             19           20    Male  101000
18       Prof          A             38           34    Male  103450
19       Prof          A             37           23    Male  124750
20       Prof          A             39           36  Female  137000
21       Prof          A             31           26    Male   89565
22       Prof          A             36           31    Male  102580
23       Prof          A             34           30    Male   93904
24       Prof          A             24           19    Male  113068
25  AssocProf          A             13            8  Female   74830
26       Prof          A             21            8    Male  106294
27       Prof          A             35           23    Male  134885
28   AsstProf          B              5            3    Male   82379
29   AsstProf          B             11            0    Male   77000
30       Prof          B             12            8    Male  118223
31       Prof          B             20            4    Male  132261
32   AsstProf          B              7            2    Male   79916
33       Prof          B             13            9    Male  117256
34   AsstProf          B              4            2    Male   80225
35   AsstProf          B              4            2  Female   80225
36   AsstProf          B              5            0  Female   77000
37       Prof          B             22           21    Male  155750
38   AsstProf          B              7            4    Male   86373
39       Prof          B             41           31    Male  125196
40  AssocProf          B              9            9    Male  100938
41       Prof          B             23            2    Male  146500
42  AssocProf          B             23           23    Male   93418
43       Prof          B             40           27    Male  101299
44       Prof          B             38           38    Male  231545
45       Prof          B             19           19    Male   94384
46       Prof          B             25           15    Male  114778
47       Prof          B             40           28    Male   98193
48       Prof          B             23           19  Female  151768
49       Prof          B             25           25  Female  140096
50   AsstProf          B              1            1    Male   70768

In [ ]:
df.rank

<bound method NDFrame.rank of          rank discipline  yrs.since.phd  yrs.service   sex  salary
1        Prof          B             19           18  Male  139750
2        Prof          B             20           16  Male  173200
3    AsstProf          B              4            3  Male   79750
4        Prof          B             45           39  Male  115000
5        Prof          B             40           41  Male  141500
..        ...        ...            ...          ...   ...     ...
393      Prof          A             33           30  Male  103106
394      Prof          A             31           19  Male  150564
395      Prof          A             42           25  Male  101738
396      Prof          A             25           15  Male   95329
397  AsstProf          A              8            4  Male   81035

[397 rows x 6 columns]>

In [ ]:
df['yrs.since.phd'].describe()

count    397.000000
mean      22.314861
std       12.887003
min        1.000000
25%       12.000000
50%       21.000000
75%       32.000000
max       56.000000
Name: yrs.since.phd, dtype: float64

In [ ]:
df['yrs.since.phd'].mean()

22.31486146095718

In [ ]:
len(df['yrs.since.phd'])

397

In [ ]:
df.head()

       rank discipline  yrs.since.phd  yrs.service   sex  salary
1      Prof          B             19           18  Male  139750
2      Prof          B             20           16  Male  173200
3  AsstProf          B              4            3  Male   79750
4      Prof          B             45           39  Male  115000
5      Prof          B             40           41  Male  141500

In [ ]:
df.groupby(['rank'])

In [ ]:
a = df.salary

In [ ]:
a>120000

1       True
2       True
3      False
4      False
5       True
       ...
393    False
394     True
395    False
396    False
397    False
Name: salary, Length: 397, dtype: bool

In [ ]:
df[df['salary']>120000]

     rank discipline  yrs.since.phd  yrs.service   sex  salary
1    Prof          B             19           18  Male  139750
2    Prof          B             20           16  Male  173200
5    Prof          B             40           41  Male  141500
7    Prof          B             30           23  Male  175000
8    Prof          B             45           45  Male  147765
..    ...        ...            ...          ...   ...     ...
387  Prof          A             29           27  Male  139219
390  Prof          A             33           18  Male  186023
391  Prof          A             40           19  Male  166605
392  Prof          A             30           19  Male  151292
394  Prof          A             31           19  Male  150564

[142 rows x 6 columns]

In [ ]:
df[(df['discipline']=='B') & (df['yrs.since.phd']>=20)]

     rank discipline  yrs.since.phd  yrs.service   sex  salary
2    Prof          B             20           16  Male  173200
4    Prof          B             45           39  Male  115000
5    Prof          B             40           41  Male  141500
7    Prof          B             30           23  Male  175000
8    Prof          B             45           45  Male  147765
..    ...        ...            ...          ...   ...     ...
351  Prof          B             56           49  Male  186960
352  Prof          B             38           38  Male   93519
353  Prof          B             26           27  Male  142500
354  Prof          B             22           20  Male  138000
356  Prof          B             25           21  Male  145028

[100 rows x 6 columns]

In [ ]:
df_1=df[df['discipline']=='B']

In [ ]:
df_1[df['yrs.since.phd']>=20]

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

     rank discipline  yrs.since.phd  yrs.service   sex  salary
2    Prof          B             20           16  Male  173200
4    Prof          B             45           39  Male  115000
5    Prof          B             40           41  Male  141500
7    Prof          B             30           23  Male  175000
8    Prof          B             45           45  Male  147765
..    ...        ...            ...          ...   ...     ...
351  Prof          B             56           49  Male  186960
352  Prof          B             38           38  Male   93519
353  Prof          B             26           27  Male  142500
354  Prof          B             22           20  Male  138000
356  Prof          B             25           21  Male  145028

[100 rows x 6 columns]

In [ ]:
df_1[(df['yrs.since.phd']>=20)][['salary','discipline']]

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

     salary discipline
2    173200          B
4    115000          B
5    141500          B
7    175000          B
8    147765          B
..      ...        ...
351  186960          B
352   93519          B
353  142500          B
354  138000          B
356  145028          B

[100 rows x 2 columns]

In [ ]:
df.head()

       rank discipline  yrs.since.phd  yrs.service   sex  salary
1      Prof          B             19           18  Male  139750
2      Prof          B             20           16  Male  173200
3  AsstProf          B              4            3  Male   79750
4      Prof          B             45           39  Male  115000
5      Prof          B             40           41  Male  141500

In [ ]:
df.iloc[0:2,[-2,-1]]

    sex  salary
1  Male  139750
2  Male  173200

In [ ]:
df.iloc[[2,3],2:5]

   yrs.since.phd  yrs.service   sex
3              4            3  Male
4             45           39  Male

In [ ]:
df.iloc[2:5,0:3]

       rank discipline  yrs.since.phd
3  AsstProf          B              4
4      Prof          B             45
5      Prof          B             40

In [ ]:
df.dtypes

rank             object
discipline       object
yrs.since.phd     int64
yrs.service       int64
sex              object
salary            int64
dtype: object

In [ ]:
df.head()

       rank discipline  yrs.since.phd  yrs.service   sex  salary
1      Prof          B             19           18  Male  139750
2      Prof          B             20           16  Male  173200
3  AsstProf          B              4            3  Male   79750
4      Prof          B             45           39  Male  115000
5      Prof          B             40           41  Male  141500

In [ ]:
df.iloc[[3,4,5,7],[1,3],]

  discipline  yrs.service
4          B           39
5          B           41
6          B            6
8          B           45